swt/design_by_contract.html
---
layout: page
title: Design_by_contract
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Design by Contract</h2>
<div class="outline-text-2" id="text-1">
<p>
Als Design by Contract bezeichnet man die formale Spezifikation der
Semantik von Methoden durch Zusicherungen. Zusicherungen beschreiben
einen Vertrag zwischen dem Aufrufer einer Methode und dem aufgerufenen.
Es gibt drei Arten von Zusicherungen:
</p>

<ul class="org-ul">
<li><i>Vorbedingungen</i>: Eigenschaften, die beim Aufruf einer Methode gelten
müssen. Die Einhaltung der Vorbedingungen ist die Pflicht des
Aufrufenden (d.h. Einhaltung der Vorbedingungen muss nicht durch den
Aufgerufenen geprüft werden).
</li>
<li><i>Nachbedingungen</i>: Eigenschaften, die nach Ausführung einer Methode
gewährleistet werden, wenn die Vorbedingungen erfüllt waren. Die
Einhaltung der Nachbedingungen ist die Pflicht des Aufgerufenen.
</li>
<li><i>Invarianten</i>: Rahmenbedingungen, die immer gelten müssen.
</li>
</ul>

<p>
Ausnahmesituationen (z.B. Fehler, Exceptions) treten auf, wenn
Zusicherungen nicht erfüllt werden.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Vererbung von Zusicherungen</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Vorbedingungen können in Subklassen nur abgeschwächt werden
</li>
<li>Nachbedingungen können in Subklassen nur verschärft werden
</li>
<li>Invarianten können in Subklassen nur verschörft werden
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Zusicherungen in Java</h3>
<div class="outline-text-3" id="text-1-2">
<p>
In Java gibt es keine Zusicherungen, die Teil der Methodensignatur sind.
Mit <code>assert ⟨Bedingung⟩ : ⟨Fehlermeldung⟩</code> können im Body einer Methode
Bedingungen geprüft werden. <code>assert</code> liefert einen <code>AssertionError</code> mit
entsprechender Fehlermeldung, wenn die Bedingung nicht erfüllt ist.
</p>
</div>
</div>
</div>
